var addressJson = {
	"上海市": {
		"上海市": [
			"卢湾区",
			"闸北区",
			"虹口区",
			"黄浦区",
			"静安区",
			"南汇区",
			"金山区",
			"青浦区",
			"宝山区",
			"长宁区",
			"杨浦区",
			"闵行区",
			"南市区",
			"徐汇区",
			"普陀区",
			"嘉定区",
			"川沙区",
			"奉贤区",
			"松江区",
			"崇明县",
			"浦东新区"
		]
	},
	"云南省": {
		"临沧地区": [
			"镇康县",
			"凤庆县",
			"云县",
			"永德县",
			"双江县",
			"沧源县",
			"耿马县",
			"临沧县"
		],
		"丽江地区": [
			"丽江县",
			"永胜县",
			"华坪县",
			"宁蒗县",
			"玉龙县",
			"古城区"
		],
		"保山地区": [
			"保山市",
			"施甸县",
			"昌宁县",
			"龙陵县",
			"腾冲县",
			"隆阳区"
		],
		"大理州": [
			"剑川县",
			"弥渡县",
			"云龙县",
			"洱源县",
			"鹤庆县",
			"祥云县",
			"永平县",
			"宾川县",
			"巍山县",
			"南涧县",
			"漾濞县",
			"大理市"
		],
		"德宏州": [
			"盈江县",
			"梁河县",
			"陇川县",
			"潞西市",
			"瑞丽市"
		],
		"怒江州": [
			"泸水县",
			"福贡县",
			"兰坪县",
			"贡山县"
		],
		"文山州": [
			"文山县",
			"麻栗坡县",
			"砚山县",
			"广南县",
			"马关县",
			"富宁县",
			"西畴县",
			"丘北县"
		],
		"昆明市": [
			"五华区",
			"盘龙区",
			"官渡区",
			"西山区",
			"东川区",
			"呈贡县",
			"安宁市",
			"富民县",
			"嵩明县",
			"晋宁县",
			"宜良县",
			"禄劝县",
			"石林县",
			"寻甸县"
		],
		"昭通地区": [
			"永善县",
			"绥江县",
			"镇雄县",
			"大关县",
			"巧家县",
			"彝良县",
			"水富县",
			"鲁甸县",
			"盐津县",
			"威信县",
			"昭通市",
			"昭阳区"
		],
		"普洱市": [
			"宁洱县",
			"墨江县",
			"景东县",
			"景谷县",
			"镇沅县",
			"江城县",
			"孟连县",
			"澜沧县",
			"西盟县",
			"云仙乡",
			"龙潭乡",
			"竹林乡",
			"倚像乡",
			"震东乡",
			"翠云乡",
			"石膏箐乡",
			"曼昔坝乡",
			"思茅港",
			"南屏乡"
		],
		"曲靖地区": [
			"马龙县",
			"陆良县",
			"师宗县",
			"罗平县",
			"富源县",
			"会泽县",
			"沾益县",
			"宣威市",
			"曲靖市"
		],
		"楚雄州": [
			"元谋县",
			"南华县",
			"牟定县",
			"武定县",
			"大姚县",
			"双柏县",
			"禄丰县",
			"永仁县",
			"姚安县",
			"楚雄市"
		],
		"玉溪市": [
			"华宁县",
			"澄江县",
			"易门县",
			"通海县",
			"江川县",
			"元江县",
			"新平县",
			"峨山县",
			"大营街镇",
			"小石桥乡 北城镇",
			"研和镇",
			"洛河乡",
			"春和镇",
			"州城镇",
			"李棋镇",
			"高仓乡",
			"红塔区"
		],
		"红河州": [
			"弥勒县",
			"红河县",
			"绿春县",
			"蒙自县",
			"泸西县",
			"建水县",
			"元阳县",
			"石屏县",
			"金平县",
			"河口县",
			"屏边县",
			"个旧市",
			"开远市"
		],
		"西双版纳州": [
			"勐海县",
			"勐腊县",
			"景洪市"
		],
		"迪庆藏族自治州": [
			"香格里拉县",
			"德钦县",
			"维西县",
			"中甸县"
		]
	},
	"内蒙古": {
		"乌兰察布盟": [
			"集宁区",
			"察哈尔右翼后旗",
			"察哈尔右翼前旗",
			"察哈尔右翼中旗",
			"丰镇市",
			"化德县",
			"凉城县",
			"商都县",
			"四子王旗",
			"兴和县",
			"卓资县"
		],
		"乌海市": [
			"海勃湾区",
			"海南区",
			"乌达区"
		],
		"兴安盟": [
			"阿尔山市",
			"科尔沁右翼前旗",
			"科尔沁右翼中旗",
			"突泉县",
			"乌兰浩特市",
			"扎赉特旗"
		],
		"包头市": [
			"白云鄂博矿区",
			"东河区",
			"九原区",
			"昆都仑区",
			"青山区",
			"石拐区",
			"达尔罕茂明安联合旗",
			"固阳县",
			"土默特右旗"
		],
		"呼伦贝尔市": [
			"海拉尔区",
			"阿荣旗",
			"陈巴尔虎旗",
			"额尔古纳市",
			"鄂伦春自治旗",
			"鄂温克族自治旗",
			"根河市",
			"满洲里市",
			"莫力达瓦达斡尔族自治旗",
			"新巴尔虎右旗",
			"新巴尔虎左旗",
			"牙克石市",
			"扎兰屯市"
		],
		"呼和浩特市": [
			"回民区",
			"赛罕区",
			"新城区",
			"玉泉区",
			"和林格尔县",
			"清水河县",
			"土默特左旗",
			"托克托县",
			"武川县"
		],
		"巴彦淖尔市": [
			"临河区",
			"磴口县",
			"杭锦后旗",
			"乌拉特后旗",
			"乌拉特前旗",
			"乌拉特中旗",
			"五原县"
		],
		"赤峰市": [
			"红山区",
			"松山区",
			"元宝山区",
			"阿鲁科尔沁旗",
			"敖汉旗",
			"巴林右旗",
			"巴林左旗",
			"喀喇沁旗",
			"克什克腾旗",
			"林西县",
			"宁城县",
			"翁牛特旗"
		],
		"通辽市": [
			"科尔沁区",
			"霍林郭勒市",
			"开鲁县",
			"科尔沁左翼后旗",
			"科尔沁左翼中旗",
			"库伦旗",
			"奈曼旗",
			"扎鲁特旗"
		],
		"鄂尔多斯市": [
			"东胜区",
			"达拉特旗",
			"鄂托克旗",
			"鄂托克前旗",
			"杭锦旗",
			"乌审旗",
			"伊金霍洛旗",
			"准格尔旗"
		],
		"锡林郭勒盟": [
			"阿巴嘎旗",
			"东乌珠穆沁旗",
			"多伦县",
			"二连浩特市",
			"苏尼特右旗",
			"苏尼特左旗",
			"太仆寺旗",
			"西乌珠穆沁旗",
			"锡林浩特市",
			"镶黄旗",
			"正蓝旗",
			"正镶白旗"
		],
		"阿拉善盟": [
			"阿拉善右旗",
			"阿拉善左旗",
			"额济纳旗"
		]
	},
	"北京市": {
		"北京市": [
			"东城区",
			"宣武区",
			"崇文区",
			"西城区",
			"海淀区",
			"通州区",
			"密云县",
			"朝阳区",
			"大兴区",
			"延庆县",
			"怀柔区",
			"平谷区",
			"石景山区",
			"丰台区",
			"昌平区",
			"顺义区",
			"门头沟区",
			"房山区"
		]
	},
	"吉林省": {
		"吉林市": [
			"昌邑区",
			"船营区",
			"丰满区",
			"龙潭区",
			"桦甸市",
			"蛟河市",
			"磐石市",
			"舒兰市",
			"永吉县"
		],
		"四平市": [
			"铁东区",
			"铁西区",
			"公主岭市",
			"梨树县",
			"双辽市",
			"伊通满族自治县"
		],
		"延边朝鲜族自治州": [
			"安图县",
			"敦化市",
			"和龙市",
			"珲春市",
			"龙井市",
			"图们市",
			"汪清县",
			"延吉市"
		],
		"松原市": [
			"宁江区",
			"长岭县",
			"扶余县",
			"前郭尔罗斯蒙古族自治县",
			"乾安县"
		],
		"白城市": [
			"洮北区",
			"大安市",
			"洮南市",
			"通榆县",
			"镇赉县"
		],
		"白山市": [
			"八道江区",
			"江源区",
			"长白朝鲜族自治县",
			"抚松县",
			"靖宇县",
			"临江市"
		],
		"辽源市": [
			"龙山区",
			"西安区",
			"东丰县",
			"东辽县"
		],
		"通化市": [
			"东昌区",
			"二道江区",
			"辉南县",
			"集安市",
			"柳河县",
			"梅河口市",
			"通化县"
		],
		"长春市": [
			"朝阳区",
			"二道区",
			"宽城区",
			"绿园区",
			"南关区",
			"双阳区",
			"德惠市",
			"九台市",
			"农安县",
			"榆树市"
		]
	},
	"四川省": {
		"乐山市": [
			"金口河区",
			"沙湾区",
			"市中区",
			"五通桥区",
			"峨边彝族自治县",
			"峨眉山市",
			"夹江县",
			"犍为县",
			"井研县",
			"马边彝族自治县",
			"沐川县"
		],
		"内江市": [
			"东兴区",
			"市中区",
			"隆昌县",
			"威远县",
			"资中县"
		],
		"凉山彝族自治州": [
			"布拖县",
			"德昌县",
			"甘洛县",
			"会东县",
			"会理县",
			"金阳县",
			"雷波县",
			"美姑县",
			"冕宁县",
			"木里藏族自治县",
			"宁南县",
			"普格县",
			"西昌市",
			"喜德县",
			"盐源县",
			"越西县",
			"昭觉县"
		],
		"南充市": [
			"高坪区",
			"嘉陵区",
			"顺庆区",
			"阆中市",
			"南部县",
			"蓬安县",
			"西充县",
			"仪陇县",
			"营山县"
		],
		"宜宾市": [
			"长宁县",
			"翠屏区",
			"高县",
			"珙县",
			"江安县",
			"筠连县",
			"南溪县",
			"屏山县",
			"兴文县",
			"宜宾县"
		],
		"巴中市": [
			"巴州区",
			"南江县",
			"平昌县",
			"通江县"
		],
		"广元市": [
			"朝天区",
			"利州区",
			"元坝区",
			"苍溪县",
			"剑阁县",
			"青川县",
			"旺苍县"
		],
		"广安市": [
			"广安区",
			"华蓥市",
			"邻水县",
			"武胜县",
			"岳池县"
		],
		"德阳市": [
			"旌阳区",
			"广汉市",
			"罗江县",
			"绵竹市",
			"什邡市",
			"中江县"
		],
		"成都市": [
			"成华区",
			"金牛区",
			"锦江区",
			"龙泉驿区",
			"青白江区",
			"青羊区",
			"温江区",
			"武侯区",
			"新都区",
			"崇州市",
			"大邑县",
			"都江堰市",
			"金堂县",
			"彭州市",
			"郫县",
			"蒲江县",
			"邛崃市",
			"双流县",
			"新津县"
		],
		"攀枝花市": [
			"东区",
			"仁和区",
			"西区",
			"米易县",
			"盐边县"
		],
		"泸州市": [
			"江阳区",
			"龙马潭区",
			"纳溪区",
			"古蔺县",
			"合江县",
			"泸县",
			"叙永县"
		],
		"甘孜藏族自治州": [
			"巴塘县",
			"白玉县",
			"丹巴县",
			"道孚县",
			"稻城县",
			"得荣县",
			"德格县",
			"甘孜县",
			"九龙县",
			"康定县",
			"理塘县",
			"泸定县",
			"炉霍县",
			"色达县",
			"石渠县",
			"乡城县",
			"新龙县",
			"雅江县"
		],
		"眉山市": [
			"东坡区",
			"丹棱县",
			"洪雅县",
			"彭山县",
			"青神县",
			"仁寿县"
		],
		"绵阳市": [
			"涪城区",
			"游仙区",
			"安县",
			"北川羌族自治县",
			"江油市",
			"平武县",
			"三台县",
			"盐亭县",
			"梓潼县"
		],
		"自贡市": [
			"大安区",
			"贡井区",
			"沿滩区",
			"自流井区",
			"富顺县",
			"荣县"
		],
		"资阳市": [
			"雁江区",
			"安岳县",
			"简阳市",
			"乐至县"
		],
		"达州市": [
			"通川区",
			"达县",
			"大竹县",
			"开江县",
			"渠县",
			"万源市",
			"宣汉县"
		],
		"遂宁市": [
			"安居区",
			"船山区",
			"大英县",
			"蓬溪县",
			"射洪县"
		],
		"阿坝藏族羌族自治州": [
			"阿坝县",
			"黑水县",
			"红原县",
			"金川县",
			"九寨沟县",
			"理县",
			"马尔康县",
			"茂县",
			"壤塘县",
			"若尔盖县",
			"松潘县",
			"汶川县",
			"小金县"
		],
		"雅安市": [
			"雨城区",
			"宝兴县",
			"汉源县",
			"芦山县",
			"名山县",
			"石棉县",
			"天全县",
			"荥经县"
		]
	},
	"天津市": {
		"天津市": [
			"河西区",
			"南开区",
			"塘沽区",
			"宝坻区",
			"北辰区",
			"滨海新区",
			"河东区",
			"河北区",
			"红桥区",
			"津南区",
			"武清区",
			"西青区",
			"蓟县",
			"静海县",
			"宁河县",
			"东丽区",
			"和平区"
		]
	},
	"宁夏": {
		"中卫市": [
			"沙坡头区",
			"海原县",
			"中宁县"
		],
		"吴忠市": [
			"红寺堡区",
			"利通区",
			"青铜峡市",
			"同心县",
			"盐池县"
		],
		"固原市": [
			"原州区",
			"泾源县",
			"隆德县",
			"彭阳县",
			"西吉县"
		],
		"石嘴山市": [
			"大武口区",
			"惠农区",
			"平罗县"
		],
		"银川市": [
			"金凤区",
			"西夏区",
			"兴庆区",
			"贺兰县",
			"灵武市",
			"永宁县"
		]
	},
	"安徽省": {
		"六安市": [
			"金安区",
			"裕安区",
			"霍邱县",
			"霍山县",
			"金寨县",
			"寿县",
			"舒城县"
		],
		"合肥市": [
			"包河区",
			"庐阳区",
			"蜀山区",
			"瑶海区",
			"长丰县",
			"肥东县",
			"肥西县"
		],
		"安庆市": [
			"大观区",
			"宜秀区",
			"迎江区",
			"枞阳县",
			"怀宁县",
			"潜山县",
			"宿松县",
			"太湖县",
			"桐城市",
			"望江县",
			"岳西县"
		],
		"宣城市": [
			"宣州区",
			"广德县",
			"绩溪县",
			"泾县",
			"旌德县",
			"郎溪县",
			"宁国市"
		],
		"宿州市": [
			"埇桥区",
			"砀山县",
			"灵璧县",
			"泗县",
			"萧县"
		],
		"巢湖市": [
			"居巢区",
			"含山县",
			"和县",
			"庐江县",
			"无为县"
		],
		"毫州市": [
			"谯城区",
			"利辛县",
			"蒙城县",
			"涡阳县"
		],
		"池州市": [
			"贵池区",
			"东至县",
			"青阳县",
			"石台县"
		],
		"淮北市": [
			"杜集区",
			"烈山区",
			"相山区",
			"濉溪县"
		],
		"淮南市": [
			"八公山区",
			"大通区",
			"潘集区",
			"田家庵区",
			"谢家集区",
			"凤台县"
		],
		"滁州市": [
			"琅琊区",
			"南谯区",
			"定远县",
			"凤阳县",
			"来安县",
			"明光市",
			"全椒县",
			"天长市"
		],
		"芜湖市": [
			"镜湖区",
			"鸠江区",
			"三山区",
			"弋江区",
			"繁昌县",
			"南陵县",
			"芜湖县"
		],
		"蚌埠市": [
			"蚌山区",
			"淮上区",
			"龙子湖区",
			"禹会区",
			"固镇县",
			"怀远县",
			"五河县"
		],
		"铜陵市": [
			"郊区",
			"狮子山区",
			"铜官山区",
			"铜陵县"
		],
		"阜阳市": [
			"颍东区",
			"颍泉区",
			"颍州区",
			"阜南县",
			"界首市",
			"临泉县",
			"太和县",
			"颍上县"
		],
		"马鞍山市": [
			"花山区",
			"金家庄区",
			"雨山区",
			"当涂县"
		],
		"黄山市": [
			"黄山区",
			"徽州区",
			"屯溪区",
			"祁门县",
			"歙县",
			"休宁县",
			"黟县"
		]
	},
	"山东省": {
		"东营市": [
			"东营区",
			"河口区",
			"垦利县",
			"利津县",
			"广饶县"
		],
		"临沂市": [
			"费县",
			"平邑县",
			"莒南县",
			"蒙阴县",
			"临沭县",
			"兰山区",
			"罗庄区",
			"河东区",
			"沂南县",
			"郯城县",
			"沂水县",
			"苍山县"
		],
		"威海市": [
			"经区",
			"高区",
			"环翠区",
			"文登市",
			"荣成市",
			"乳山市"
		],
		"德州市": [
			"德城区",
			"陵县",
			"宁津县",
			"庆云县",
			"临邑县",
			"齐河县",
			"平原县",
			"夏津县",
			"武城县",
			"乐陵市",
			"禹城市"
		],
		"日照市": [
			"岚山区",
			"莒县",
			"东港区",
			"五莲县"
		],
		"枣庄市": [
			"市中区",
			"薛城区",
			"峄城区",
			"滕州市",
			"山亭区",
			"台儿庄区"
		],
		"泰安市": [
			"高新区",
			"泰山区",
			"岱岳区",
			"宁阳县",
			"东平县",
			"新泰市",
			"肥城市"
		],
		"济南市": [
			"历下区",
			"章丘市",
			"高新区",
			"市中区",
			"槐荫区",
			"天桥区",
			"历城区",
			"长清区",
			"平阴县",
			"济阳县",
			"商河县"
		],
		"济宁市": [
			"市中区",
			"任城区",
			"微山县",
			"鱼台县",
			"金乡县",
			"嘉祥县",
			"汶上县",
			"泗水县",
			"梁山县",
			"曲阜市",
			"兖州市",
			"邹城市"
		],
		"淄博市": [
			"淄川区",
			"张店区",
			"博山区",
			"临淄区",
			"周村区",
			"桓台县",
			"高青县",
			"沂源县"
		],
		"滨州市": [
			"邹平县",
			"滨城区",
			"惠民县",
			"阳信县",
			"无棣县",
			"沾化县",
			"博兴县"
		],
		"潍坊市": [
			"滨海开发区",
			"潍城区",
			"寒亭区",
			"坊子区",
			"奎文区",
			"临朐县",
			"昌乐县",
			"青州市",
			"诸城市",
			"寿光市",
			"安丘市",
			"高密市",
			"昌邑市"
		],
		"烟台市": [
			"开发区",
			"芝罘区",
			"福山区",
			"牟平区",
			"莱山区",
			"长岛县",
			"龙口市",
			"莱阳市",
			"莱州市",
			"蓬莱市",
			"招远市",
			"栖霞市",
			"海阳市"
		],
		"聊城市": [
			"东昌府区",
			"阳谷县",
			"莘县",
			"茌平县",
			"东阿县",
			"冠县",
			"高唐县",
			"临清市"
		],
		"莱芜市": [
			"莱城区",
			"钢城区"
		],
		"菏泽市": [
			"牡丹区",
			"开发区",
			"单县",
			"巨野县",
			"成武县",
			"郓城县",
			"东明县",
			"曹县",
			"鄄城县",
			"定陶县"
		],
		"青岛市": [
			"市南区",
			"市北区",
			"四方区",
			"黄岛区",
			"崂山区",
			"李沧区",
			"城阳区",
			"胶州市",
			"即墨市",
			"平度市",
			"胶南市",
			"莱西市"
		]
	},
	"山西省": {
		"临汾市": [
			"尧都区",
			"安泽县",
			"大宁县",
			"汾西县",
			"浮山县",
			"古县",
			"洪洞县",
			"侯马市",
			"霍州市",
			"吉县",
			"蒲县",
			"曲沃县",
			"隰县",
			"乡宁县",
			"襄汾县",
			"翼城县",
			"永和县"
		],
		"吕梁市": [
			"离石区",
			"方山县",
			"汾阳市",
			"交城县",
			"交口县",
			"岚县",
			"临县",
			"柳林县",
			"石楼县",
			"文水县",
			"孝义市",
			"兴县",
			"中阳县"
		],
		"大同市": [
			"城区",
			"矿区",
			"南郊区",
			"新荣区",
			"大同县",
			"广灵县",
			"浑源县",
			"灵丘县",
			"天镇县",
			"阳高县",
			"左云县"
		],
		"太原市": [
			"尖草坪区",
			"晋源区",
			"万柏林区",
			"小店区",
			"杏花岭区",
			"迎泽区",
			"古交市",
			"娄烦县",
			"清徐县",
			"阳曲县"
		],
		"忻州市": [
			"忻府区",
			"保德县",
			"代县",
			"定襄县",
			"繁峙县",
			"河曲县",
			"静乐县",
			"岢岚县",
			"宁武县",
			"偏关县",
			"神池县",
			"五台县",
			"五寨县",
			"原平市"
		],
		"晋中市": [
			"榆次区",
			"和顺县",
			"介休市",
			"灵石县",
			"平遥县",
			"祁县",
			"寿阳县",
			"太谷县",
			"昔阳县",
			"榆社县",
			"左权县"
		],
		"晋城市": [
			"城区",
			"高平市",
			"陵川县",
			"沁水县",
			"阳城县",
			"泽州县"
		],
		"朔州市": [
			"平鲁区",
			"朔城区",
			"怀仁县",
			"山阴县",
			"应县",
			"右玉县"
		],
		"运城市": [
			"盐湖区",
			"河津市",
			"稷山县",
			"绛县",
			"临猗县",
			"平陆县",
			"芮城县",
			"万荣县",
			"闻喜县",
			"夏县",
			"新绛县",
			"永济市",
			"垣曲县"
		],
		"长治市": [
			"城区",
			"郊区",
			"长治县",
			"长子县",
			"壶关县",
			"黎城县",
			"潞城市",
			"平顺县",
			"沁县",
			"沁源县",
			"屯留县",
			"武乡县",
			"襄垣县"
		],
		"阳泉市": [
			"城区",
			"郊区",
			"矿区",
			"平定县",
			"盂县"
		]
	},
	"广东省": {
		"东莞市": [
			"莞城区",
			"其他"
		],
		"中山市": [
			"中山市"
		],
		"云浮市": [
			"云城区",
			"罗定市",
			"新兴县",
			"郁南县",
			"云安县"
		],
		"佛山市": [
			"禅城区",
			"高明区",
			"南海区",
			"三水区",
			"顺德区"
		],
		"广州市": [
			"萝岗区",
			"从化市",
			"增城市",
			"番禺区",
			"南沙区",
			"天河区",
			"越秀区",
			"白云区",
			"海珠区",
			"花都区",
			"黄埔区",
			"荔湾区"
		],
		"惠州市": [
			"惠城区",
			"惠阳区",
			"博罗县",
			"惠东县",
			"龙门县"
		],
		"揭阳市": [
			"榕城区",
			"惠来县",
			"揭东县",
			"揭西县",
			"普宁市"
		],
		"梅州市": [
			"梅江区",
			"大埔县",
			"丰顺县",
			"蕉岭县",
			"梅县",
			"平远县",
			"五华县",
			"兴宁市"
		],
		"汕头市": [
			"潮南区",
			"潮阳区",
			"澄海区",
			"濠江区",
			"金平区",
			"龙湖区",
			"南澳县"
		],
		"汕尾市": [
			"城区",
			"海丰县",
			"陆丰市",
			"陆河县"
		],
		"江门市": [
			"江海区",
			"蓬江区",
			"新会区",
			"恩平市",
			"鹤山市",
			"开平市",
			"台山市"
		],
		"河源市": [
			"源城区",
			"东源县",
			"和平县",
			"连平县",
			"龙川县",
			"紫金县"
		],
		"深圳市": [
			"宝安区",
			"福田区",
			"龙岗区",
			"罗湖区",
			"南山区",
			"盐田区"
		],
		"清远市": [
			"清城区",
			"佛冈县",
			"连南瑶族自治县",
			"连山壮族瑶族自治县",
			"连州市",
			"清新县",
			"阳山县",
			"英德市"
		],
		"湛江市": [
			"赤坎区",
			"麻章区",
			"坡头区",
			"霞山区",
			"雷州市",
			"廉江市",
			"遂溪县",
			"吴川市",
			"徐闻县"
		],
		"潮州市": [
			"湘桥区",
			"潮安县",
			"饶平县"
		],
		"珠海市": [
			"斗门区",
			"金湾区",
			"香洲区"
		],
		"肇庆市": [
			"鼎湖区",
			"端州区",
			"德庆县",
			"封开县",
			"高要市",
			"广宁县",
			"怀集县",
			"四会市"
		],
		"茂名市": [
			"茂港区",
			"茂南区",
			"电白县",
			"高州市",
			"化州市",
			"信宜市"
		],
		"阳江市": [
			"江城区",
			"阳春市",
			"阳东县",
			"阳西县"
		],
		"韶关市": [
			"曲江区",
			"武江区",
			"浈江区",
			"乐昌市",
			"南雄市",
			"仁化县",
			"乳源瑶族自治县",
			"始兴县",
			"翁源县",
			"新丰县"
		]
	},
	"广西省": {
		"北海市": [
			"海城区",
			"铁山港区",
			"银海区",
			"合浦县"
		],
		"南宁地区": [
			"江南区",
			"良庆区",
			"青秀区",
			"西乡塘区",
			"兴宁区",
			"邕宁区",
			"宾阳县",
			"横县",
			"隆安县",
			"马山县",
			"上林县",
			"武鸣县"
		],
		"崇左市": [
			"江洲区",
			"大新县",
			"扶绥县",
			"龙州县",
			"宁明县",
			"凭祥市",
			"天等县"
		],
		"来宾市": [
			"兴宾区",
			"合山市",
			"金秀瑶族自治县",
			"武宣县",
			"象州县",
			"忻城县"
		],
		"柳州地区": [
			"城中区",
			"柳北区",
			"柳南区",
			"鱼峰区",
			"柳城县",
			"柳江县",
			"鹿寨县",
			"融安县",
			"融水苗族自治县",
			"三江侗族自治县"
		],
		"桂林市": [
			"叠彩区",
			"七星区",
			"象山区",
			"秀峰区",
			"雁山区",
			"恭城瑶族自治县",
			"灌阳县",
			"荔蒲县",
			"临桂县",
			"灵川县",
			"龙胜各族自治县",
			"平乐县",
			"全州县",
			"兴安县",
			"阳朔县",
			"永福县",
			"资源县"
		],
		"梧州市": [
			"长洲区",
			"蝶山区",
			"万秀区",
			"苍梧县",
			"岑溪市",
			"蒙山县",
			"藤县"
		],
		"河池市": [
			"金城江区",
			"巴马瑶族自治县",
			"大化瑶族自治县",
			"东兰县",
			"都安瑶族自治县",
			"凤山县",
			"环江毛南族自治县",
			"罗城仫佬族自治县",
			"南丹县",
			"天峨县",
			"宜州市"
		],
		"玉林市": [
			"玉州区",
			"北流市",
			"博白县",
			"陆川县",
			"容县",
			"兴业县"
		],
		"百色市": [
			"右江区",
			"德保县",
			"靖西县",
			"乐业县",
			"凌云县",
			"隆林各族自治县",
			"那坡县",
			"平果县",
			"田东县",
			"田林县",
			"田阳县",
			"西林县"
		],
		"贵港市": [
			"港北区",
			"港南区",
			"覃塘区",
			"桂平市",
			"平南县"
		],
		"贺州市": [
			"八步区",
			"平桂管理区",
			"富川瑶族自治县",
			"昭平县",
			"钟山县"
		],
		"钦州市": [
			"钦北区",
			"钦南区",
			"灵山县",
			"浦北县"
		],
		"防城港市": [
			"防城区",
			"港口区",
			"东兴市",
			"上思县"
		]
	},
	"新疆": {
		"乌鲁木齐市": [
			"达坂城区",
			"米东区",
			"沙依巴克区",
			"水磨沟区",
			"天山区",
			"头屯河区",
			"新市区",
			"乌鲁木齐县"
		],
		"五家渠市": [],
		"伊犁哈萨克自治州": [
			"察布查尔锡伯自治县",
			"巩留县",
			"霍城县",
			"奎屯市",
			"尼勒克县",
			"特克斯县",
			"新源县",
			"伊宁市",
			"伊宁县",
			"昭苏县"
		],
		"克孜勒苏柯尔克孜自治州": [
			"阿合奇县",
			"阿克陶县",
			"阿图什市",
			"乌恰县"
		],
		"克拉玛依市": [
			"白碱滩区",
			"独山子区",
			"克拉玛依区",
			"乌尔禾区"
		],
		"博乐塔拉蒙古族自治州": [
			"博乐市",
			"精河县",
			"温泉县"
		],
		"吐鲁番市": [
			"鄯善县",
			"吐鲁番市",
			"托克逊县"
		],
		"和田地区": [
			"策勒县",
			"和田市",
			"和田县",
			"洛浦县",
			"民丰县",
			"墨玉县",
			"皮山县",
			"于田县"
		],
		"哈密地区": [
			"巴里坤哈萨克自治县",
			"哈密市",
			"伊吾县"
		],
		"喀什地区": [
			"巴楚县",
			"伽师县",
			"喀什市",
			"麦盖提县",
			"莎车县",
			"疏附县",
			"疏勒县",
			"塔什库尔干塔吉克自治县",
			"叶城县",
			"英吉沙县",
			"岳普湖县",
			"泽普县"
		],
		"图木舒克市": [],
		"塔城地区": [
			"额敏县",
			"和布克赛尔蒙古自治县",
			"沙湾县",
			"塔城市",
			"托里县",
			"乌苏市",
			"裕民县"
		],
		"巴音郭楞蒙古自治州": [
			"博湖县",
			"和静县",
			"和硕县",
			"库尔勒市",
			"轮台县",
			"且末县",
			"若羌县",
			"尉犁县",
			"焉耆回族自治县"
		],
		"昌吉回族自治州": [
			"昌吉市",
			"阜康市",
			"呼图壁县",
			"吉木萨尔县",
			"玛纳斯县",
			"木垒哈萨克自治县",
			"奇台县"
		],
		"石河子市": [],
		"阿克苏地区": [
			"阿克苏市",
			"阿瓦提县",
			"拜城县",
			"柯坪县",
			"库车县",
			"沙雅县",
			"温宿县",
			"乌什县",
			"新和县"
		],
		"阿勒泰地区": [
			"阿勒泰市",
			"布尔津县",
			"福海县",
			"富蕴县",
			"哈巴河县",
			"吉木乃县",
			"青河县"
		],
		"阿拉尔市": []
	},
	"江苏省": {
		"南京市": [
			"白下区",
			"鼓楼区",
			"建邺区",
			"江宁区",
			"六合区",
			"浦口区",
			"栖霞区",
			"秦淮区",
			"下关区",
			"玄武区",
			"雨花台区",
			"高淳县",
			"溧水县"
		],
		"南通市": [
			"崇川区",
			"港闸区",
			"通州区",
			"海安县",
			"海门市",
			"启东市",
			"如东县",
			"如皋市"
		],
		"宿迁市": [
			"宿城区",
			"宿豫区",
			"沭阳县",
			"泗洪县",
			"泗阳县"
		],
		"常州市": [
			"戚墅堰区",
			"天宁区",
			"武进区",
			"新北区",
			"钟楼区",
			"金坛市",
			"溧阳市"
		],
		"徐州市": [
			"鼓楼区",
			"贾汪区",
			"泉山区",
			"铜山区",
			"云龙区",
			"丰县",
			"沛县",
			"邳州市",
			"睢宁县",
			"新沂市"
		],
		"扬州市": [
			"逛陵区",
			"邗江区",
			"维扬区",
			"宝应县",
			"仪征市",
			"高邮市",
			"江都市"
		],
		"无锡市": [
			"崇安区",
			"南长区",
			"北塘区",
			"锡山区",
			"惠山区",
			"滨湖区",
			"江阴市",
			"宜兴市"
		],
		"泰州市": [
			"高港区",
			"海陵区",
			"姜堰市",
			"靖江市",
			"泰兴市",
			"兴化市"
		],
		"淮安市": [
			"楚州区",
			"淮阴区",
			"清河区",
			"清浦区",
			"洪泽县",
			"金湖县",
			"涟水县",
			"盱眙县"
		],
		"盐城市": [
			"亭湖区",
			"盐都区",
			"滨海县",
			"大丰市",
			"东台市",
			"阜宁县",
			"建湖县",
			"射阳县",
			"响水县"
		],
		"苏州市": [
			"常熟市",
			"张家港市",
			"昆山市",
			"吴江市",
			"太仓市",
			"相城区",
			"吴中区",
			"虎丘区",
			"沧浪区",
			"金闾区",
			"平江区"
		],
		"连云港市": [
			"海州区",
			"连云区",
			"新浦区",
			"东海县",
			"赣榆县",
			"灌南县",
			"灌云县"
		],
		"镇江市": [
			"丹徒区",
			"京口区",
			"润州区",
			"丹阳市",
			"句容市",
			"扬中市"
		]
	},
	"江西省": {
		"上饶市": [
			"信州区",
			"德兴市",
			"广丰县",
			"横峰县",
			"鄱阳县",
			"铅山县",
			"上饶县",
			"万年县",
			"婺源县",
			"弋阳县",
			"余干县",
			"玉山县"
		],
		"九江市": [
			"庐山区",
			"浔阳区",
			"德安县",
			"都昌县",
			"共青城市",
			"湖口县",
			"九江县",
			"彭泽县",
			"瑞昌市",
			"武宁县",
			"星子县",
			"修水县",
			"永修县"
		],
		"南昌市": [
			"东湖区",
			"青山湖区",
			"青云谱区",
			"湾里区",
			"安义县",
			"进贤县",
			"南昌县",
			"新建县"
		],
		"吉安市": [
			"吉州区",
			"青原区",
			"安福县",
			"吉安县",
			"吉水县",
			"井冈山市",
			"遂川县",
			"泰和县",
			"万安县",
			"峡江县",
			"新干县",
			"永丰县",
			"永新县"
		],
		"宜春市": [
			"袁州区",
			"丰城市",
			"奉新县",
			"高安市",
			"靖安县",
			"上高县",
			"铜鼓县",
			"万载县",
			"宜丰县",
			"樟树市"
		],
		"抚州市": [
			"临川区",
			"崇仁县",
			"东乡县",
			"广昌县",
			"金溪县",
			"乐安县",
			"乐安县",
			"南城县",
			"南丰县",
			"宜黄县",
			"资溪县"
		],
		"新余市": [
			"渝水区",
			"分宜县"
		],
		"景德镇市": [
			"昌江区",
			"珠山区",
			"浮梁县",
			"乐平市"
		],
		"萍乡市": [
			"安源区",
			"湘东区",
			"莲花县",
			"芦溪县",
			"上栗县"
		],
		"赣州市": [
			"章贡区",
			"安远县",
			"崇义县",
			"大余县",
			"定南县",
			"赣县",
			"会昌县",
			"龙南县",
			"南康市",
			"宁都县",
			"全南县",
			"瑞金市",
			"上犹县",
			"石城县",
			"信丰县",
			"兴国县",
			"寻乌县",
			"于都县"
		],
		"鹰潭市": [
			"月湖区",
			"贵溪市",
			"余江县"
		]
	},
	"河北省": {
		"保定市": [
			"北市区",
			"南市区",
			"新市区",
			"安国市",
			"安新县",
			"博野县",
			"定兴县",
			"定州市",
			"阜平县",
			"高碑店市",
			"高阳县",
			"涞水县",
			"涞源县",
			"蠡县",
			"满城县",
			"清苑县",
			"曲阳县",
			"容城县",
			"顺平县",
			"唐县",
			"望都县",
			"雄县",
			"徐水县",
			"易县",
			"涿州市"
		],
		"唐山市": [
			"丰南区",
			"丰润区",
			"古冶区",
			"开平区",
			"路北区",
			"路南区",
			"乐亭县",
			"滦南县",
			"滦县",
			"迁安市",
			"迁西县",
			"唐海县",
			"玉田县",
			"遵化市"
		],
		"廊坊市": [
			"安次区",
			"广阳区",
			"霸州市",
			"大厂回族自治县",
			"大城县",
			"固安县",
			"三河市",
			"文安县",
			"香河县",
			"永清县"
		],
		"张家口市": [
			"赤城县",
			"桥东区",
			"桥西区",
			"下花园区",
			"宣化区",
			"崇礼县",
			"沽源县",
			"怀安县",
			"怀来县",
			"康保县",
			"尚义县",
			"万全县",
			"蔚县",
			"宣化县",
			"阳原县",
			"张北县",
			"涿鹿县"
		],
		"承德市": [
			"双滦区",
			"双桥区",
			"鹰手营子矿区",
			"承德县",
			"丰宁满族自治县",
			"宽城满族自治县",
			"隆化县",
			"滦平县",
			"平泉县",
			"围场满族蒙古族自治县",
			"兴隆县"
		],
		"沧州市": [
			"沧县",
			"东光县",
			"海兴县",
			"河间市",
			"黄骅市",
			"孟村回族自治县",
			"南皮县",
			"青县",
			"任丘市",
			"肃宁县",
			"吴桥县",
			"献县",
			"盐山县",
			"新华区",
			"运河区",
			"泊头市"
		],
		"石家庄市": [
			"长安区",
			"井陉矿区",
			"桥东区",
			"桥西区",
			"新华区",
			"裕华区",
			"高邑县",
			"藁城市",
			"晋州市",
			"井陉县",
			"灵寿县",
			"鹿泉市",
			"栾城县",
			"平山县",
			"深泽县",
			"无极县",
			"辛集市",
			"新乐市",
			"行唐县",
			"元氏县",
			"赞皇县",
			"赵县",
			"正定县"
		],
		"秦皇岛市": [
			"北戴河区",
			"海港区",
			"山海关区",
			"昌黎县",
			"抚宁县",
			"卢龙县",
			"青龙满族自治县",
			"长安区",
			"井陉矿区",
			"桥东区",
			"桥西区",
			"新华区",
			"裕华区",
			"高邑县",
			"藁城市",
			"晋州市",
			"井陉县",
			"灵寿县",
			"鹿泉市",
			"栾城县",
			"平山县",
			"深泽县",
			"无极县",
			"辛集市",
			"新乐市",
			"行唐县",
			"元氏县",
			"赞皇县",
			"赵县",
			"正定县"
		],
		"衡水市": [
			"桃城区",
			"安平县",
			"阜城县",
			"故城县",
			"冀州市",
			"景县",
			"饶阳县",
			"深州市",
			"武强县",
			"武邑县",
			"枣强县"
		],
		"邢台市": [
			"桥西区",
			"桥东区",
			"柏乡县",
			"广宗县",
			"巨鹿县",
			"临城县",
			"临西县",
			"隆尧县",
			"内丘县",
			"南宫市",
			"南和县",
			"宁晋县",
			"平乡县",
			"清河县",
			"任县",
			"沙河市",
			"威县",
			"新河县",
			"邢台县"
		],
		"邯郸市": [
			"丛台区",
			"峰峰矿区",
			"复兴区",
			"邯山区",
			"成安县",
			"磁县",
			"大名县",
			"肥乡县",
			"馆陶县",
			"广平县",
			"邯郸县",
			"鸡泽县",
			"临漳县",
			"邱县",
			"曲周县",
			"涉县",
			"魏县",
			"武安市",
			"永年县"
		]
	},
	"河南省": {
		"三门峡市": [
			"湖滨区",
			"灵宝市",
			"卢氏县",
			"陕县",
			"渑池县",
			"义马市"
		],
		"信阳市": [
			"平桥区",
			"浉河区",
			"固始县",
			"光山县",
			"淮滨县",
			"潢川县",
			"罗山县",
			"商城县",
			"息县",
			"新县"
		],
		"南阳市": [
			"宛城区",
			"卧龙区",
			"邓州市",
			"方城县",
			"内乡县",
			"南召县",
			"社旗县",
			"唐河县",
			"桐柏县",
			"西峡县",
			"淅川县",
			"新野县",
			"镇平县"
		],
		"周口市": [
			"川汇区",
			"郸城县",
			"扶沟县",
			"淮阳县",
			"鹿邑县",
			"商水县",
			"沈丘县",
			"太康县",
			"西华县",
			"项城市"
		],
		"商丘市": [
			"梁园区",
			"睢阳区",
			"民权县",
			"宁陵县",
			"睢县",
			"夏邑县",
			"永城市",
			"虞城县",
			"柘城县"
		],
		"安阳市": [
			"北关区",
			"龙安区",
			"文峰区",
			"殷都区",
			"安阳县",
			"滑县",
			"林州市",
			"内黄县",
			"汤阴县"
		],
		"平顶山市": [
			"石龙区",
			"卫东区",
			"新华区",
			"湛河区",
			"宝丰县",
			"郏县",
			"鲁山县",
			"汝州市",
			"舞钢市",
			"叶县"
		],
		"开封市": [
			"鼓楼区",
			"金明区",
			"龙亭区",
			"顺河回族区",
			"禹王台区",
			"开封县",
			"兰考县",
			"杞县",
			"通许县",
			"尉氏县"
		],
		"新乡市": [
			"凤泉区",
			"红旗区",
			"牧野区",
			"卫滨区",
			"长垣县",
			"封丘县",
			"辉县市",
			"获嘉县",
			"卫辉市",
			"新乡县",
			"延津县",
			"原阳县"
		],
		"洛阳市": [
			"瀍河回族区",
			"吉利区",
			"涧西区",
			"老城区",
			"洛龙区",
			"西工区",
			"栾川县",
			"洛宁县",
			"孟津县",
			"汝阳县",
			"嵩县",
			"新安县",
			"偃师市",
			"伊川县",
			"宜阳县"
		],
		"济源市": [],
		"濮阳市": [
			"华龙区",
			"范县",
			"南乐县",
			"濮阳县",
			"清丰县",
			"台前县"
		],
		"焦作市": [
			"解放区",
			"马村区",
			"山阳区",
			"中站区",
			"博爱县",
			"孟州市",
			"沁阳市",
			"温县",
			"武陟县",
			"修武县"
		],
		"缧河市": [
			"郾城区",
			"源汇区",
			"召陵区",
			"临颍县",
			"舞阳县"
		],
		"许昌市": [
			"魏都区",
			"长葛市",
			"襄城县",
			"许昌县",
			"鄢陵县",
			"禹州市"
		],
		"郑州市": [
			"二七区",
			"管城回族区",
			"惠济区",
			"金水区",
			"上街区",
			"中原区",
			"登封市",
			"巩义市",
			"新密市",
			"新郑市",
			"荥阳市",
			"中牟县"
		],
		"驻马店市": [
			"驿城区",
			"泌阳县",
			"平舆县",
			"确山县",
			"汝南县",
			"上蔡县",
			"遂平县",
			"西平县",
			"新蔡县",
			"正阳县"
		],
		"鹤壁市": [
			"鹤山区",
			"淇滨区",
			"山城区",
			"浚县",
			"淇县"
		]
	},
	"浙江省": {
		"丽水市": [
			"莲都区",
			"缙云县",
			"景宁畲族自治县",
			"龙泉市",
			"青田县",
			"庆元县",
			"松阳县",
			"遂昌县",
			"云和县"
		],
		"台州市": [
			"黄岩区",
			"椒江区",
			"路桥区",
			"临海市",
			"三门县",
			"天台县",
			"温岭市",
			"仙居县",
			"玉环县"
		],
		"嘉兴市": [
			"南湖区",
			"秀洲区",
			"海宁市",
			"海盐县",
			"嘉善县",
			"平湖市",
			"桐乡市"
		],
		"宁波市": [
			"海曙区",
			"将东江",
			"江北区",
			"北仑区",
			"镇海区",
			"鄞州区",
			"象山县",
			"宁海县",
			"余姚市",
			"慈溪市",
			"奉化市"
		],
		"杭州市": [
			"上城区",
			"下城区",
			"江干区",
			"拱墅区",
			"西湖区",
			"滨江区",
			"萧山区",
			"余杭区",
			"桐庐县",
			"淳安县",
			"建德市",
			"富阳市",
			"临安市"
		],
		"温州市": [
			"龙湾区",
			"鹿城区",
			"瓯海区",
			"苍南县",
			"洞头县",
			"乐清市",
			"平阳县",
			"瑞安市",
			"泰顺县",
			"文成县",
			"永嘉县"
		],
		"湖州市": [
			"南浔区",
			"吴兴区",
			"安吉县",
			"长兴县",
			"德清县"
		],
		"绍兴市": [
			"越城区",
			"上虞市",
			"绍兴县",
			"嵊州市",
			"新昌县",
			"诸暨市"
		],
		"舟山市": [
			"定海区",
			"普陀区",
			"岱山县",
			"嵊泗县"
		],
		"衢州市": [
			"柯城区",
			"衢江区",
			"常山县",
			"江山市",
			"开化县",
			"龙游县"
		],
		"金华市": [
			"金东区",
			"婺城区",
			"东阳市",
			"兰溪市",
			"磐安县",
			"浦江县",
			"武义县",
			"义乌市",
			"永康市"
		]
	},
	"海南省": {
		"海南省直辖县级行政区划": [
			"白沙黎族自治县",
			"保亭黎族苗族自治县",
			"昌江黎族自治县",
			"澄迈县",
			"儋州市",
			"定安县",
			"东方市",
			"乐东黎族自治县",
			"临高县",
			"陵水黎族自治县",
			"南沙群岛",
			"琼海市",
			"琼中黎族苗族自治县",
			"屯昌县",
			"万宁市",
			"文昌市",
			"五指山市",
			"西沙群岛",
			"中沙群岛的岛礁及其海域"
		],
		"海口市": [
			"龙华区",
			"美兰区",
			"琼山区",
			"秀英区"
		]
	},
	"湖北省": {
		"仙桃市": [],
		"十堰市": [
			"茅箭区",
			"张湾区",
			"丹江口市",
			"房县",
			"郧西县",
			"郧县",
			"竹山县",
			"竹溪县"
		],
		"咸宁市": [
			"咸安区",
			"赤壁市",
			"崇阳县",
			"嘉鱼县",
			"通城县",
			"通山县"
		],
		"天门市": [],
		"孝感市": [
			"孝南区",
			"安陆市",
			"大悟县",
			"汉川市",
			"孝昌县",
			"应城市",
			"云梦县"
		],
		"宜昌市": [
			"点军区",
			"伍家岗区",
			"西陵区",
			"猇亭区",
			"夷陵区",
			"长阳土家族自治县",
			"当阳市",
			"五峰土家族自治县",
			"兴山县",
			"宜都市",
			"远安县",
			"枝江市",
			"秭归县"
		],
		"恩施土家族苗族自治州": [
			"巴东县",
			"恩施市",
			"鹤峰县",
			"建始县",
			"来凤县",
			"利川市",
			"咸丰县",
			"宣恩县"
		],
		"武汉市": [
			"蔡甸区",
			"东西湖区",
			"汉南区",
			"汉阳区",
			"洪山区",
			"黄陂区",
			"江岸区",
			"江汉区",
			"江夏区",
			"硚口区",
			"青山区",
			"武昌区",
			"新洲区"
		],
		"潜江市": [],
		"神农架林区": [],
		"荆州市": [
			"荆州区",
			"沙市区",
			"公安县",
			"洪湖市",
			"监利县",
			"江陵县",
			"石首市",
			"松滋市"
		],
		"荆门市": [
			"东宝区",
			"掇刀区",
			"京山县",
			"沙洋县",
			"钟祥市"
		],
		"襄樊市": [
			"樊城区",
			"襄城区",
			"襄阳区",
			"保康县",
			"谷城县",
			"老河口市",
			"南漳县",
			"宜城市",
			"枣阳市"
		],
		"鄂州市": [
			"鄂城区",
			"华容区",
			"梁子湖区"
		],
		"随州市": [
			"曾都区",
			"广水市",
			"随县"
		],
		"黄冈市": [
			"黄州区",
			"红安县",
			"黄梅县",
			"罗田县",
			"麻城市",
			"蕲春县",
			"团风县",
			"武穴市",
			"浠水县",
			"英山县"
		],
		"黄石市": [
			"黄石港区",
			"铁山区",
			"西塞山区",
			"下陆区",
			"大冶市",
			"阳新县"
		]
	},
	"湖南省": {
		"娄底市": [
			"娄星区",
			"冷水江市",
			"涟源市",
			"双峰县",
			"新化县"
		],
		"岳阳市": [
			"君山区",
			"岳阳楼区",
			"云溪区",
			"华容县",
			"临湘市",
			"汨罗市",
			"平江县",
			"湘阴县",
			"岳阳县"
		],
		"常德市": [
			"鼎城区",
			"武陵区",
			"安乡县",
			"汉寿县",
			"津市市",
			"澧县",
			"临澧县",
			"石门县",
			"桃源县"
		],
		"张家界市": [
			"武陵源区",
			"永定区",
			"慈利县",
			"桑植县"
		],
		"怀化市": [
			"鹤城区",
			"辰溪县",
			"洪江市",
			"会同县",
			"靖州苗族侗族自治县",
			"麻阳苗族自治县",
			"通道侗族自治县",
			"新晃侗族自治县",
			"溆浦县",
			"沅陵县",
			"芷江侗族自治县",
			"中方县"
		],
		"株洲市": [
			"荷塘区",
			"芦淞区",
			"石峰区",
			"天元区",
			"茶陵县",
			"醴陵市",
			"炎陵县",
			"攸县",
			"株洲县"
		],
		"永州市": [
			"冷水滩区",
			"零陵区",
			"道县",
			"东安县",
			"江华瑶族自治县",
			"江永县",
			"蓝山县",
			"宁远县",
			"祁阳县",
			"双牌县",
			"新田县"
		],
		"湘潭市": [
			"雨湖区",
			"岳塘区",
			"韶山市",
			"湘潭县",
			"湘乡市"
		],
		"湘西土家族苗族自治州": [
			"保靖县",
			"凤凰县",
			"古丈县",
			"花垣县",
			"吉首市",
			"龙山县",
			"泸溪县",
			"永顺县"
		],
		"益阳市": [
			"赫山区",
			"资阳区",
			"安化县",
			"南县",
			"桃江县",
			"沅江市"
		],
		"衡阳市": [
			"南岳区",
			"石鼓区",
			"雁峰区",
			"蒸湘区",
			"珠晖区",
			"常宁市",
			"衡东县",
			"衡南县",
			"衡山县",
			"衡阳县",
			"耒阳市",
			"祁东县"
		],
		"邵阳市": [
			"北塔区",
			"大祥区",
			"双清区",
			"城步苗族自治县",
			"洞口县",
			"隆回县",
			"邵东县",
			"邵阳县",
			"绥宁县",
			"武冈市",
			"新宁县",
			"新邵县"
		],
		"郴州市": [
			"北湖区",
			"苏仙区",
			"安仁县",
			"桂东县",
			"桂阳县",
			"嘉禾县",
			"临武县",
			"汝城县",
			"宜章县",
			"永兴县",
			"资兴市"
		],
		"长沙市": [
			"芙蓉区",
			"开福区",
			"天心区",
			"雨花区",
			"岳麓区",
			"长沙县",
			"浏阳市",
			"宁乡县",
			"望城县"
		]
	},
	"甘肃省": {
		"临夏回族自治州": [
			"东乡族自治县",
			"广河县",
			"和政县",
			"积石山保安族东乡族撒拉族自治县",
			"康乐县",
			"临夏市",
			"临夏县",
			"永靖县"
		],
		"兰州市": [
			"安宁区",
			"城关区",
			"红古区",
			"七里河区",
			"西固区",
			"皋兰县",
			"永登县",
			"榆中县"
		],
		"嘉峪关市": [],
		"天水市": [
			"麦积区",
			"秦州区",
			"甘谷县",
			"秦安县",
			"清水县",
			"武山县",
			"张家川回族自治县"
		],
		"定西地区": [
			"安定区",
			"临洮县",
			"陇西县",
			"岷县",
			"通渭县",
			"渭源县",
			"漳县"
		],
		"平凉市": [
			"崆峒区",
			"崇信县",
			"华亭县",
			"泾川县",
			"静宁县",
			"灵台县",
			"庄浪县"
		],
		"庆阳市": [
			"西峰区",
			"合水县",
			"华池县",
			"环县",
			"宁县",
			"庆城县",
			"镇原县",
			"正宁县"
		],
		"张掖市": [
			"甘州区",
			"高台县",
			"临泽县",
			"民乐县",
			"山丹县",
			"肃南裕固族自治县"
		],
		"武威市": [
			"凉州区",
			"古浪县",
			"民勤县",
			"天祝藏族自治县"
		],
		"甘南藏族自治州": [
			"迭部县",
			"合作市",
			"临潭县",
			"碌曲县",
			"玛曲县",
			"夏河县",
			"舟曲县",
			"卓尼县"
		],
		"白银市": [
			"白银区",
			"平川区",
			"会宁县",
			"景泰县",
			"靖远县"
		],
		"酒泉市": [
			"肃州区",
			"阿克塞哈萨克族自治县",
			"敦煌市",
			"瓜州县",
			"金塔县",
			"肃北蒙古族自治县",
			"玉门市"
		],
		"金昌市": [
			"金川区",
			"永昌县"
		],
		"陇南市": [
			"武都区",
			"成县",
			"宕昌县",
			"康县",
			"徽县",
			"礼县",
			"两当县",
			"文县",
			"西和县"
		]
	},
	"福建省": {
		"三明市": [
			"梅列区",
			"三元区",
			"大田县",
			"建宁县",
			"将乐县",
			"明溪县",
			"宁化县",
			"清流县",
			"沙县",
			"泰宁县",
			"永安市",
			"尤溪县"
		],
		"南平市": [
			"延平区",
			"光泽县",
			"建瓯市",
			"建阳市",
			"浦城县",
			"邵武市",
			"顺昌县",
			"松溪县",
			"武夷山市",
			"政和县"
		],
		"厦门市": [
			"海沧区",
			"湖里区",
			"集美区",
			"思明区",
			"同安区",
			"翔安区"
		],
		"宁德市": [
			"蕉城区",
			"福安市",
			"福鼎市",
			"古田县",
			"屏南县",
			"寿宁县",
			"霞浦县",
			"柘荣县",
			"周宁县"
		],
		"泉州市": [
			"丰泽区",
			"鲤城区",
			"洛江区",
			"泉港区",
			"安溪县",
			"德化县",
			"惠安县",
			"金门县",
			"晋江市",
			"南安市",
			"石狮市",
			"永春县"
		],
		"漳州市": [
			"龙文区",
			"芗城区",
			"长泰县",
			"东山县",
			"华安县",
			"龙海市",
			"南靖县",
			"平和县",
			"云霄县",
			"漳浦县",
			"诏安县"
		],
		"福州市": [
			"仓山区",
			"鼓楼区",
			"晋安区",
			"马尾区",
			"台江区",
			"长乐市",
			"福清市",
			"连江县",
			"罗源县",
			"闽侯县",
			"闽清县",
			"平潭县",
			"永泰县"
		],
		"莆田市": [
			"城厢区",
			"涵江区",
			"荔城区",
			"秀屿区",
			"仙游县"
		],
		"龙岩市": [
			"新罗区",
			"长汀县",
			"连城县",
			"上杭县",
			"武平县",
			"永定县",
			"漳平市"
		]
	},
	"西藏": {
		"山南地区": [
			"措美县",
			"错那县",
			"贡嘎县",
			"加查县",
			"浪卡子县",
			"隆子县",
			"洛扎县",
			"乃东县",
			"琼结县",
			"曲松县",
			"桑日县",
			"扎囊县"
		],
		"拉萨市": [
			"城关区",
			"达孜县",
			"当雄县",
			"堆龙德庆县",
			"林周县",
			"墨竹工卡县",
			"尼木县",
			"曲水县"
		],
		"日喀则地区": [
			"昂仁县",
			"白朗县",
			"定结县",
			"定日县",
			"岗巴县",
			"吉隆县",
			"江孜县",
			"康马县",
			"拉孜县",
			"南木林县",
			"聂拉木县",
			"仁布县",
			"日喀则市",
			"萨嘎县",
			"萨迦县",
			"谢通门县",
			"亚东县",
			"仲巴县"
		],
		"昌都地区": [
			"八宿县",
			"边坝县",
			"察雅县",
			"昌都县",
			"丁青县",
			"贡觉县",
			"江达县",
			"类乌齐县",
			"洛隆县",
			"芒康县",
			"左贡县"
		],
		"林芝地区": [
			"波密县",
			"察隅县",
			"工布江达县",
			"朗县",
			"林芝县",
			"米林县",
			"墨脱县"
		],
		"那曲地区": [
			"安多县",
			"巴青县",
			"班戈县",
			"比如县",
			"嘉黎县",
			"那曲县",
			"尼玛县",
			"聂荣县",
			"申扎县",
			"索县"
		],
		"阿里地区": [
			"措勤县",
			"噶尔县",
			"改则县",
			"革吉县",
			"普兰县",
			"日土县",
			"札达县"
		]
	},
	"贵州省": {
		"六盘水市": [
			"六枝特区",
			"钟山区",
			"盘县",
			"水城县"
		],
		"安顺市": [
			"西秀区",
			"关岭布依族苗族自治县",
			"平坝县",
			"普定县",
			"镇宁布依族苗族自治县",
			"紫云苗族布依族自治县",
			"开发区"
		],
		"毕节地区": [
			"毕节市",
			"大方县",
			"赫章县",
			"金沙县",
			"纳雍县",
			"黔西县",
			"威宁彝族回族苗族自治县",
			"织金县"
		],
		"贵阳市": [
			"白云区",
			"花溪区",
			"南明区",
			"乌当区",
			"小河区",
			"云岩区",
			"开阳县",
			"清镇市",
			"息烽县",
			"修文县"
		],
		"遵义市": [
			"红花岗区",
			"汇川区",
			"赤水市",
			"道真仡佬族苗族自治县",
			"凤冈县",
			"湄潭县",
			"仁怀市",
			"绥阳县",
			"桐梓县",
			"务川仡佬族苗族自治县",
			"习水县",
			"余庆县",
			"正安县",
			"遵义县"
		],
		"铜仁地市": [
			"万山特区",
			"德江县",
			"江口县",
			"石阡县",
			"思南县",
			"松桃苗族自治县",
			"铜仁市",
			"沿河土家族自治县",
			"印江土家族苗族自治县",
			"玉屏侗族自治县"
		],
		"黔东南苗族侗族自治州": [
			"岑巩县",
			"从江县",
			"丹寨县",
			"黄平县",
			"剑河县",
			"锦屏县",
			"凯里市",
			"雷山县",
			"黎平县",
			"麻江县",
			"榕江县",
			"三穗县",
			"施秉县",
			"台江县",
			"天柱县",
			"镇远县"
		],
		"黔南布依族苗族自治州": [
			"长顺县",
			"都匀市",
			"独山县",
			"福泉市",
			"贵定县",
			"惠水县",
			"荔波县",
			"龙里县",
			"罗甸县",
			"平塘县",
			"三都水族自治县",
			"瓮安县"
		],
		"黔西南布依族苗族自治州": [
			"安龙县",
			"册亨县",
			"普安县",
			"晴隆县",
			"望谟县",
			"兴仁县",
			"兴义市",
			"贞丰县"
		]
	},
	"辽宁省": {
		"丹东市": [
			"凤城市",
			"元宝区",
			"振兴区",
			"振安区",
			"宽甸满族自治县",
			"东港市",
			"开发区"
		],
		"大连市": [
			"中山区",
			"西岗区",
			"沙河口区",
			"甘井子区",
			"旅顺口区",
			"金州区",
			"开发区",
			"瓦房店",
			"普兰店",
			"庄河",
			"长海县",
			"保税区",
			"高新园区",
			"普湾新区"
		],
		"抚顺市": [
			"新抚区",
			"东洲区",
			"望花区",
			"顺城区",
			"清原满族自治县",
			"抚顺县",
			"新宾满族自治县",
			"李石经济开发区",
			"高湾新区"
		],
		"朝阳市": [
			"凌源市",
			"双塔区",
			"龙城区",
			"朝阳县",
			"建平县",
			"北票市",
			"喀喇沁左翼蒙古族自治县",
			"市区（城镇）",
			"开发区"
		],
		"本溪市": [
			"桓仁",
			"平山区",
			"溪湖区",
			"明山区",
			"南芬区",
			"本溪县",
			"石桥子经济开发区"
		],
		"沈阳市": [
			"和平区",
			"沈河区",
			"大东区",
			"皇姑区",
			"铁西区",
			"苏家屯区",
			"东陵区",
			"沈北新区",
			"于洪区",
			"辽中县",
			"康平县",
			"法库县",
			"新民市",
			"于洪区三环外",
			"东陵区三环外",
			"浑南新区"
		],
		"盘锦市": [
			"盘山县",
			"双台子区",
			"兴隆台区",
			"大洼县",
			"经济开发区"
		],
		"营口市": [
			"大石桥市",
			"站前区",
			"西市区",
			"鲅鱼圈区",
			"老边区",
			"盖州市",
			"高新园区"
		],
		"葫芦岛市": [
			"兴城市",
			"连山区",
			"龙港区",
			"南票区",
			"绥中县",
			"建昌县",
			"葫芦岛市区（镇）",
			"杨家杖子开发区"
		],
		"辽阳市": [
			"灯塔市",
			"白塔区",
			"文圣区",
			"宏伟区",
			"弓长岭区",
			"太子河区",
			"辽阳县"
		],
		"铁岭市": [
			"开原市",
			"银州区",
			"清河区",
			"铁岭县",
			"西丰县",
			"昌图县",
			"调兵山市",
			"开发区",
			"凡河新区"
		],
		"锦州市": [
			"北票市",
			"北宁市",
			"古塔区",
			"凌河区",
			"太和区",
			"黑山县",
			"义县",
			"凌海市",
			"锦州开发区",
			"松山新区",
			"高新区"
		],
		"阜新市": [
			"海州区",
			"新邱区",
			"太平区",
			"清河门区",
			"细河区",
			"阜新蒙古族自治县",
			"市区（乡镇）",
			"彰武",
			"开发区"
		],
		"鞍山市": [
			"铁东区",
			"铁西区",
			"千山区",
			"立山区",
			"海城市",
			"台安县",
			"岫岩满族自治县"
		]
	},
	"重庆市": {
		"重庆市": [
			"渝中区",
			"江北区",
			"九龙坡区",
			"北碚区",
			"南桐",
			"渝北区",
			"巴县",
			"綦江县",
			"永川市",
			"大足县",
			"铜梁县",
			"壁山",
			"万县",
			"忠县",
			"奉节县",
			"梁平县",
			"巫溪县",
			"涪陵区",
			"垫江县",
			"武隆县",
			"大渡口区",
			"沙坪坝区",
			"南岸区",
			"万盛区",
			"双桥区",
			"长寿区",
			"巴南区",
			"合川市",
			"江津市",
			"荣昌县",
			"潼南县",
			"璧山县",
			"万州区",
			"云阳县",
			"巫山县",
			"开县",
			"城口县",
			"丰都县",
			"南川市",
			"黔江区",
			"石柱土家族自治县",
			"酉阳土家族苗族自治县",
			"彭水苗族土家族自治县",
			"秀山土家族苗族自治县"
		]
	},
	"陕西省": {
		"咸阳市": [
			"秦都区",
			"渭城区",
			"杨陵区",
			"彬县",
			"长武县",
			"淳化县",
			"泾阳县",
			"礼泉县",
			"乾县",
			"三原县",
			"武功县",
			"兴平市",
			"旬邑县",
			"永寿县"
		],
		"商洛市": [
			"商州区",
			"丹凤县",
			"洛南县",
			"山阳县",
			"商南县",
			"镇安县",
			"柞水县"
		],
		"安康市": [
			"汉滨区",
			"白河县",
			"汉阴县",
			"岚皋县",
			"宁陕县",
			"平利县",
			"石泉县",
			"旬阳县",
			"镇坪县",
			"紫阳县"
		],
		"宝鸡市": [
			"陈仓区",
			"金台区",
			"渭滨区",
			"扶风县",
			"凤县",
			"凤翔县",
			"麟游县",
			"陇县",
			"眉县",
			"岐山县",
			"千阳县",
			"太白县"
		],
		"延安市": [
			"宝塔区",
			"安塞县",
			"富县",
			"甘泉县",
			"黄陵县",
			"黄龙县",
			"洛川县",
			"吴起县",
			"延长县",
			"延川县",
			"宜川县",
			"志丹县",
			"子长县"
		],
		"榆林市": [
			"榆阳区",
			"定边县",
			"府谷县",
			"横山县",
			"佳县",
			"靖边县",
			"米脂县",
			"清涧县",
			"神木县",
			"绥德县",
			"吴堡县",
			"子洲县"
		],
		"汉中市": [
			"汉台区",
			"城固县",
			"佛坪县",
			"留坝县",
			"略阳县",
			"勉县",
			"南郑县",
			"宁强县",
			"西乡县",
			"洋县",
			"镇巴县"
		],
		"渭南市": [
			"临渭区",
			"白水县",
			"澄城县",
			"大荔县",
			"富平县",
			"韩城市",
			"合阳县",
			"华县",
			"华阴市",
			"蒲城县",
			"潼关县"
		],
		"西安市": [
			"灞桥区",
			"碑林区",
			"长安区",
			"莲湖区",
			"临潼区",
			"未央区",
			"新城区",
			"阎良区",
			"雁塔区",
			"高陵县",
			"户县",
			"蓝田县",
			"周至县"
		],
		"铜川市": [
			"王益区",
			"耀州区",
			"印台区",
			"宜君县"
		]
	},
	"青海省": {
		"果洛藏族自治州": [
			"班玛县",
			"达日县",
			"甘德县",
			"久治县",
			"玛多县",
			"玛沁县"
		],
		"海东地区": [
			"互助土族自治县",
			"化隆回族自治县",
			"乐都县",
			"民和回族土族自治县",
			"平安县",
			"循化撒拉族自治县"
		],
		"海北藏族自治州": [
			"刚察县",
			"海晏县",
			"门源回族自治县",
			"祁连县"
		],
		"海南藏族自治州": [
			"共和县",
			"贵德县",
			"贵南县",
			"同德县",
			"兴海县"
		],
		"海西蒙古族藏族自治州": [
			"德令哈市",
			"都兰县",
			"格尔木市",
			"天峻县",
			"乌兰县"
		],
		"玉树藏族自治州": [
			"称多县",
			"囊谦县",
			"曲麻莱县",
			"玉树县",
			"杂多县",
			"治多县"
		],
		"西宁市": [
			"城北区",
			"城东区",
			"城西区",
			"城中区",
			"大通回族土族自治县",
			"湟源县",
			"湟中县"
		],
		"黄南藏族自治州": [
			"河南蒙古族自治县",
			"尖扎县",
			"同仁县",
			"泽库县"
		]
	},
	"黑龙江省": {
		"七台河市": [
			"桃山区",
			"新兴区",
			"茄子河区",
			"勃利县"
		],
		"伊春市": [
			"伊春区",
			"南岔区",
			"翠峦区",
			"美溪区",
			"五营区",
			"汤旺河区",
			"乌伊岭区",
			"上甘岭区",
			"铁力市",
			"友好区",
			"西林区",
			"新青区",
			"金山屯区",
			"乌马河区",
			"带岭区",
			"红星区",
			"嘉荫县",
			"梅里斯区"
		],
		"佳木斯": [
			"永红区",
			"向阳区",
			"前进区",
			"郊区",
			"抚远县",
			"富锦市",
			"东风区",
			"桦南县",
			"桦川县",
			"汤原县",
			"同江市"
		],
		"双鸭山市": [
			"尖山区",
			"岭东区",
			"四方台区",
			"宝清县",
			"宝山区",
			"集贤县",
			"友谊县",
			"饶河县"
		],
		"哈尔滨市": [
			"道里区",
			"道外区",
			"南岗区",
			"平房区",
			"香坊区",
			"松北区",
			"动力区",
			"开发区",
			"依兰县",
			"呼兰区",
			"方正县",
			"宾县",
			"延寿县",
			"巴彦县",
			"阿城区",
			"木兰县",
			"双城市",
			"通河县",
			"尚志市",
			"五常市"
		],
		"大兴安岭地区": [
			"呼玛县",
			"漠河县",
			"松岭区",
			"呼中区",
			"塔河县",
			"加格达奇区",
			"新林区"
		],
		"大庆市": [
			"萨尔图区",
			"让胡路区",
			"大同区",
			"肇源县",
			"治县",
			"龙凤区",
			"红岗区",
			"肇州县",
			"林甸县",
			"杜尔伯特",
			"东风新村"
		],
		"牡丹江市": [
			"东安区",
			"爱民区",
			"东宁县",
			"绥芬河市",
			"宁安市",
			"阳明区",
			"西安区",
			"林口县",
			"海林市",
			"穆棱市"
		],
		"绥化市": [
			"北林区",
			"兰西县",
			"庆安县",
			"绥棱县",
			"肇东市",
			"望奎县",
			"青冈县",
			"明水县",
			"安达市",
			"海伦市"
		],
		"鸡西市": [
			"鸡冠区",
			"滴道区",
			"梨树区",
			"鸡东县",
			"密山市",
			"恒山区",
			"城子河区",
			"麻山区",
			"虎林市"
		],
		"鹤岗市": [
			"向阳区",
			"工农区",
			"东山区",
			"萝北县",
			"南山区",
			"兴安区",
			"兴山区",
			"绥滨县"
		],
		"黑河市": [
			"爱辉区",
			"嫩江县",
			"北安市",
			"逊克县",
			"孙吴县",
			"五大连池市"
		],
		"齐齐哈尔市": [
			"龙沙区",
			"建华区",
			"铁锋区",
			"依安县",
			"泰来县",
			"克山县",
			"拜泉县",
			"昂昂溪区",
			"富拉尔基区",
			"碾子山区",
			"龙江县",
			"甘南县",
			"富裕县",
			"克东县",
			"讷河市",
			"梅里斯区"
		]
	}
};

function Address(province, city, district) {
	this.province = province;
	this.city = city;
	this.district = district;
	this.cityInitLength = city.options.length;
	this.districtInitLength = district.options.length;

	this.init = function() {
		for(key in addressJson) {
			this.province.add(new Option(key, key));
		}

		var obj = this;
		this.province.onchange = function() {
			obj.city.length = obj.cityInitLength;
			obj.district.length = obj.districtInitLength;
			for(key in addressJson[this.value]) {
				obj.city.add(new Option(key, key));
			}
		}

		this.city.onchange = function() {
			obj.district.length = obj.districtInitLength;
			var list = addressJson[obj.province.value][obj.city.value];
			for(var i = 0; i < list.length; i++) {
				obj.district.add(new Option(list[i], list[i]));
			}
		}
	}

	this.change = function(provinceVal, cityVal, districtVal) {
		this.province.value = provinceVal;
		this.city.length = this.cityInitLength;
		for(key in addressJson[provinceVal]) {
			this.city.add(new Option(key, key));
		}
		if(cityVal) {
			this.city.value = cityVal;
			this.district.length = this.districtInitLength;
			if(districtVal) {
				var list = addressJson[provinceVal][cityVal];
				for(var i = 0; i < list.length; i++) {
					this.district.add(new Option(list[i], list[i]));
				}
				this.district.value = districtVal;
			}
		}
	}
	this.init();
	return this;
}